[
    "If I could have dinner with anyone, dead or alive... ...I would choose alive.",
    "Two guys walk into a bar. The third guy ducks.",
    "Why can't Barbie get pregnant? Because Ken comes in a different box.",
    "Why was the musician arrested? He got in treble.",
    "Did you hear about the guy who blew his entire lottery winnings on a limousine? He had nothing left to chauffeur it.",
    "What do you do if a bird shits on your car? Don't ask her out again.",
    "He was a real gentlemen and always opened the fridge door for me",
    "What should you do before criticizing Pac-Man? WAKA WAKA WAKA mile in his shoes",
    "How do you spell Canda? C,eh,N,eh,D,eh",
    "You ever notice that the most dangerous thing about marijuana is getting caught with it?",
    "What did Arnold Schwarzenegger say at the abortion clinic? Hasta last vista, baby.",
    "My speech today will be like a mini-skirt. Long enough to cover the essentials but short enough to hold your attention!",
    "Thanksgiving joke What does Miley Cyrus eat for Thanksgiving? Twerky! Just kidding... Drugs. She eats drugs.",
    "Why do you never see elephants hiding in trees? 'Cause they are freaking good at it",
    "How did she die raking leaves? She fell out of the tree.",
    "My son just got a tattoo of a heart, a spade, a club, and a diamond, all without my permission. I guess I'll deal with him later.",
    "What do you call a potato in space? Spudnik",
    "What happens to a necrophiliac after death? Reserection",
    "Why did the chicken hold a seance? To get to the other side.",
    "Where do baby cows go to eat lunch? At the calf-eteria.",
    "I am looking forward to 6pm Thanksgiving Day when Walmart opens its doors for its annual sale of trampled human corpses.",
    "Yttrium-barium-copper oxide walks into a bar The bartender tells him, \"We don't serve superconductors here.\" He leaves without resistance.",
    "Ibuprofen is my favorite headache medicine that also sounds like a reggae professor.",
    "Ted Cruz getting elected.",
    "Before I destroy a wasp's nest I like to capture a single wasp and tell it my entire diabolical plan.",
    "INTERVIEWER: Why do you want to work here? ME: *crumbs tumbling from my mouth* Oh, I don't. I was just walking by and saw you had donuts.",
    "Coming on valentines day. Fifty shades of grey. There won't be a dry seat in the cinema.",
    "Did you hear about the midget psychic who escaped from prison? He's a small medium at large.",
    "What's the difference between a car tyre, and 365 condoms? One's a Goodyear, an the other's a great year.",
    "Roses are red, Violets are blue. I have a gun. Get in the van.",
    "I've struggled for years to be above the influence... But I've never been able to get that high",
    "With Facebook, you can stay in touch with people you would otherwise never talk to, but that's only one of the many awful things about it",
    "Have you ever heard of the movie \"Constipation\"? No? Most likely because it never came out.",
    "I saw a French rifle on eBay today It's never been fired but I heard it was dropped once.",
    "I was drinking at the bar, so I took a bus home. That may not be a big deal to you, but I've never driven a bus before!",
    "Why did the Xbox owner cross the road? To fuck your mom.",
    "I don't believe in Bigfoot; because he never believed in me. I'd scan the crowd at my ballet recitals, and always see that one empty seat.",
    "Not to get too technical, but chemistry says alcohol IS a solution. So I win.",
    "I'm terrible at telling jokes... I always punch up the fuck lines",
    "\"You know what, we need a huge spoon to take care of this\" -Guy who invented shovels",
    "What do grandparents smell like? \"Depends\"",
    "7% of all hearing loss is a result of sitting in a restaurant next to a table full of women who just received dessert.",
    "What do you call a blind dinosaur? A do-think-he-saurus :) !! Lol What do you call a blind dinosaurs dog? A do-you-think-he-saurus-rex",
    "I just bought a very tiny amphibian for a pet. It's my-newt!",
    "This may be not be a mainstream opinion, but I don't believe you should cut down a Christmas tree unless you intend on eating it.",
    "Why don't most fans like the first 39 episodes of DBZ? Its pretty stupid, just Saiyan.",
    "My ex-wife still misses me... But her aim is gettin better.",
    "What do you call a three-humped camel? Pregnant",
    "What do you call Jay-Z having a leg transplant? A hip-hop hip op.",
    "Wanna hear a pun about long hair? Rapunzel.",
    "How do you know if your wine was made in the 90's? It smells like teen spirit.",
    "What was the name of Paul Revere's favorite porno mag? The British are Coming",
    "Yup. If pasta & antipasta ever touch, they annihilate. For your safety, that's why restaurants never serve them together.",
    "Alcohol is like Lysol for feelings, it won't kill all of them.",
    "\"Update the Force, young Skywalker\" Said Adobe Wan Kenobi.",
    "lookin for a quick and easy way to beef up that scrawny bod and really turn some heads at the beach? float dead in a lake",
    "\"What's that?\" A divorce jar. Every time we fight you put a dollar in and I'm a little bit closer to freedom. *puts in dollar* \"WTH!?!\"",
    "If you have a parrot and you don't teach it to say,\"Help, they've turned me into a parrot.\" you are wasting everybody's time.",
    "My 8 y/o memorized my 12 character password that has upper and lowercase letters, numbers and symbols but can't remember to flush the toilet",
    "Me: waiter, do you have frog legs? Waiter: of course monsieur Me: good, hop over there and get me a beer",
    "It's comforting to know that the US government works the same way as a college student when it comes to deadlines... They both wait until the last minute, then get an extension.",
    "When I was interviewed for a job in the chemistry department, they asked me if I had lab experience. I said I was more of a cat person.",
    "There are two types of people in this world. And I hate them both.",
    "Two skeptics walk into a bar.. I'd tell you what happens next but noone knows",
    "Everytime you pull the trigger a bullet loses its job... Because it gets FIRED.",
    "It would be great to be born on Earth and die on Mars. Preferably not on the point of impact.",
    "You could be a \"Before\" model.",
    "Descartes walks into the bar. The bartender asks him, \"will you have your usual tonight?\" Rene replies \"I think not\" and he disappears.",
    "My dog can predict when an earthquake is going to happen. But television doorbell versus actual doorbell baffles him every time.",
    "[at my funeral] So young, how did he die? He ran into oncoming traffic after walking past a group of adults saying the word \"bae\"",
    "What do you get when you cross a pig and a Christmas tree...? A Porky-Pine",
    "What do you call a frisbee that's more than a friend? Frisbae",
    "What's the best part of a pregnancy joke? The delivery.",
    "What's a pirate's favourite type of weaponry? It's ARRRtillery!",
    "*Guy tries giving me his phone number* Me: Oh no thank you. I already have one",
    "Breaking Bad is my favorite documentary about what it takes to be an entrepreneur while balancing family life.",
    "A black cat just ate a four leaf clover. That can't be good....",
    "Why can't a bike stand on it's own? Because it is two tired.",
    "I don't understand women. I also don't understand how a car works but I still drive it.",
    "What happens when Turkeys get the common cold? They quit smoking.",
    "My girlfriend is great in bed... But I don't know how my best friend would know that.",
    "Why did the composer go to the chiropractor? Because he had Bach problems",
    "A sheep, a drum and a snake fall down a cliff badum tss",
    "What do you call a green cow in a field? Invisibull.",
    "I went in to hospital for an operation... I asked the anaesthetist if I could administer the needle myself, and he said: \"Sure, knock yourself out\".",
    "A piece of shit walks into a bar It's my dad... My dad is a piece of shit.",
    "What is the last thing that tickle-me elmo gets before he leaves the factory? Two test tickles",
    "Did you hear about the skeleton who didn't go to prom? He had no body to go with.",
    "Over the past year, my se[delete]xual fetishes have been slowly getting more perverse. But it wasn't until I spanked a statue that I realised I'd hit rock bottom.",
    "What is the best advice to give a worm?  Sleep late.",
    "so as I went in to vote this morning, an old lady told me to make sure I voted for the candidate that could make change. Boy, is my bank teller going to be surprised!",
    "Waiting for the day when someone finally says that I'm \"the one,\" but isn't talking to a police officer.",
    "Some people say Glenn Frey got pneumonia from the cold... But that can't be true because he said the Heat is On.",
    "A duck walks up to a prostitute.... And says, \"put it on my bill\"",
    "\"You're a unit of power Joe.\" \"I'm a Watt?\"",
    "Why is it that the more numbers someone has in their e-mail address, the less I respect them?",
    "If you ever need help learning C++, I can give you some pointers. And you can keep me as a reference.",
    "Why was the baby ant so confused? Because all of his uncles were ants!",
    "After the Thanksgiving dinner, everyone says (-1)/8",
    "Simba - \"welcome to... The bone zone\" Nala - \"the what?\" Simba - \"elephant graveyard. I said elephant graveyard\"",
    "How are doctors so well tempered even under heavy stress? They have a lot of patients",
    "I wonder if dog's had facebook, would they put our picture as their profile picture.",
    "How do you find a blind man in a nudist colony? It's not hard",
    "My Grandfather had the heart of a lion and a lifetime ban from the zoo.",
    "How many tickles does it take to make an octopus laugh? Ten-tickles.",
    "What do you get when you cross an insomniac, agnostic and a dyslexic? Someone who stays up all night wondering if there is a Dog.",
    "What do you call a number that won't sit still? A roamin' numeral.",
    "Where do drinks go on vacation? Coaster Rica",
    "A dyslexic man walked into a bra..",
    "What type of school did Sherlock Holmes go to? Elementary :)",
    "Coffee so good it helps a little old lady cross the street.",
    "So a blind man walks into a bar He hurts himself pretty badly.",
    "If you're not one of the first five boys in the yard, you almost never get a milkshake.",
    "How do you figure out which contestant in a Ms. America pageant is a prostitute? Look for the one with the sash that says \"I da ho\".",
    "Standing in the park, I was wondering why a Frisbee gets larger the closer it gets. And then it hit me.",
    "[Ouija board] Spirits are you there? U R C U T E D O Y O U H A V E K I K *flips board*",
    "My internet connection on my farm was be terrible until I moved the router in the horse barn. Now I have stable WiFi.",
    "An irishman walks out of a bar...",
    "Brexit There is a new slimming product in town. It is called Brexit. It'll help you lose a lot of pounds.",
    "Why do golfers wear 2 pairs of pants? Incase he gets a hole in one",
    "What is the favorite food joint of dubstep makers? Sub-WUB-WUB-WUB-way",
    "Two fish are in a tank... One is driving, and the other is manning the guns.",
    "A Spanish magician announced that for his final trick, he would vanish into thin air. He counted down: uno, dos, then POOF! He was gone, without a tres.",
    "What's the last thing that goes through a bug's mind when he crashes into a windshield? His butt.",
    "I overheard two female coworkers say there was a creepy dude listening to their conversation.",
    "What did the Marine Biologist say when he saw two eels making love? \"It's a Moray.\"",
    "Shoutout to people who don't know what the opposite of in is.",
    "Jared Fogle was guilty and got 16 years He was just grateful for anything under 18.",
    "When I was 8 years old, my dad got me with the worst dad joke ever. He said he was going to the store and would be back soon..",
    "What do you call it when two designers argue about what file type to export a graphic to? Getting into a bit of a .tiff!",
    "How many people does it take to save the world? zero.",
    "How do skeletons reproduce? They bone.",
    "How do you make an Amish woman happy? Three Men-A-Night",
    "My friend used my todo list to roll a blunt He's high on my list of priorities",
    "I keep getting the urge to purchase a big white bear from the arctic.. Doc says I might have \"Buy Polar\" disorder",
    "Ever since the news came out about Samsung.... Their phones have been blowing up.",
    "What's a lumberjack's favorite director? TimBuuurrrrrrrton",
    "When someone tells you to \"get a Life,\" just take theirs. They'll be happy you took their advice, and you'll be happy they're dead.",
    "I showed my son a floppy disk today... ...he said: 'oh cool, you 3D-printed a save icon'",
    "What do golfers do on nights out? **par**ty.",
    "Never attribute to malice what can be adequately explained by stupidity.",
    "Why are mountains so funny? Because they are hill-areas",
    "\"Sugar\" is the only word in the English language where \"su-\" makes a \"sh\" sound. At least, I'm pretty sure...",
    "How many software engineers does it take to change a light bulb? None. It's a hardware problem.",
    "My life.",
    "What did the hamburger say when it pleaded 'not guilty'? I've been flamed!",
    "Broken pencils... ...are pointless.",
    "What's a dinosaur's least favorite reindeer? Comet! =D",
    "Why do seagulls live by the sea? If they lived by the bay they'd be bagels.",
    "What happens when frogs park illegally? They get toad.",
    "Dear Religion, Pics or it didn't happen. Love, Science",
    "I get turned on whenever I eat greek dips.. I think I'm a hummuse[delete]xual.",
    "Why do elephants have 4 feet? Because in the animal kingdom 6 inches just wont do",
    "What do you call a bald porcupine? Pointless.",
    "[dinner table] gfs dad: so what do you do for a living me: human trafficking *he chokes* gf: he's a crossing guard dad",
    "Why did the feminist refuse to work at the post office? Because it was a mail dominated industry",
    "What job do rabbits at hotels have?  Bellhop.",
    "What do you call a hot day in Canada? A Nova Scorcha!",
    "Why did Adele cross the road? She wanted to say hello from the other side.",
    "I have a split personality No he doesn't",
    "What do you call a dinosaur that raps about life? A philosorapper",
    "The Philippines is the only country in the world who turns its flag upside down during times of war while French people remove the red and blue color",
    "Wanna heare a joke about potassium? K",
    "Colonel Mustard. In the kitchen. Eating soup. Calm down.",
    "Billy Mays is up in Heaven partying like it's $19.99.",
    "Where did Napoleon keep his armies? In his sleevies.",
    "What did the mermaid do last Saturday night? She went out with the tide.",
    "Cops are looking for a man who robbed a store using scissors. They say the guy could be a real danger--unless you have a rock.",
    "Toilet stolen from police station Cops have nothing to go on.",
    "Chuck Norris never wet his bed as a child. The bed wet itself out of fear.",
    "Is your refrigerator running? Because if it is, I might vote for it.",
    "Did you hear about the magic tractor? It went down a hill and turned into a field",
    "My weather forecast is always \"room temperature.\"",
    "Any salad can be a Caesar salad if you stab it enough.",
    "How do you make Holy water? Boil the hell out of it.",
    "What did Patrick Stewart say when he proposed to his wife? Engage.",
    "What's the difference between a plumber and a scientist? Pronounce this word: unionized",
    "Did you hear about the scarecrow who won a Nobel Prize? He's out standing in his field.",
    "My clients have a 86% survival rate, which makes me an above-average babysitter.",
    "Why do I tell jokes in elevators? Because they're funny on many levels.",
    "Hi, my name's Ray. I'll be drawing your blood today as soon as I finish this Capri Sun. *misses hole 4 times then punches straw through bag*",
    "A Roman guy walks into a bar... He holds up two fingers and says \"Five beers please!\"",
    "What kind of pizzas can tell the future? Medium Pizzas",
    "What cars do wolves drive? Auuuuuuuuuuuuudis!",
    "What do you call rude fungi? Shiit-talking mushrooms",
    "Did you hear the one about the perfume store? I heard their manufacturing was in an ol' factory.",
    "What game do two strangers with Social Anxiety play? Don't Break the Ice",
    "I witnessed a murder today.. then I realized it was just a group of crows.",
    "Waiter is there soup on the menu ? No madam I wiped it off !",
    "Why do felines always win board games? Because they are cheetahs.",
    "What do you call a nun sleep walking? A roamin' Catholic",
    "What did one snowman say to the other snowman? I smell carrots too."
]